{"class_name": "Model", "config": {"name": "model_22", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input"}, "name": "input", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"name": "tdist_0", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_764", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "tdist_0", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_136", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_136", "inbound_nodes": [[["tdist_0", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "tdist_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_765", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "tdist_1", "inbound_nodes": [[["activation_136", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_137", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_137", "inbound_nodes": [[["tdist_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "tdist_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_766", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "tdist_2", "inbound_nodes": [[["activation_137", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "mask", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAAAAAAIAAAAHAAAAUwAAAHMkAAAAdACgAXQAagJ0AKADfAB8AaECZAFkAo0CdACg\nBHwAoQGhAlMAKQNO6f////8pAdoEYXhpcykF2gFL2gRjYXN02gNhbnnaCW5vdF9lcXVhbNoFZHR5\ncGWpAtoBWNoIbWFza192YWypAHILAAAA+mMvZ2xvYmFsL2hvbWUvdXNlcnMvYnBuYWNobWFuL2Fu\nYWNvbmRhMy9lbnZzL3RmMi9saWIvcHl0aG9uMy44L3NpdGUtcGFja2FnZXMvZW5lcmd5Zmxvdy9h\ncmNocy9lZm4ucHnaDXBmbl9tYXNrX2Z1bmNRAAAAcwIAAAAAAw==\n", [0.0], null], "function_type": "lambda", "module": "energyflow.archs.efn", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "mask", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_138", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_138", "inbound_nodes": [[["tdist_2", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "sum", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "sum", "inbound_nodes": [[["mask", 0, 0, {}], ["activation_138", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_0", "inbound_nodes": [[["sum", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_139", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_139", "inbound_nodes": [[["dense_0", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["activation_139", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_140", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_140", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["activation_140", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_141", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_141", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["activation_141", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_142", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_142", "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["activation_142", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}