{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 4], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "tdist_0", "class_name": "TimeDistributed", "config": {"name": "tdist_0", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_60", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "activation_47", "class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["tdist_0", 0, 0, {}]]]}, {"name": "tdist_1", "class_name": "TimeDistributed", "config": {"name": "tdist_1", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_61", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"name": "activation_48", "class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["tdist_1", 0, 0, {}]]]}, {"name": "tdist_2", "class_name": "TimeDistributed", "config": {"name": "tdist_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "dense_62", "trainable": true, "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["activation_48", 0, 0, {}]]]}, {"name": "mask", "class_name": "Lambda", "config": {"name": "mask", "trainable": true, "function": ["4wIAAAAAAAAAAgAAAAUAAABTAAAAcyQAAAB0AGoBdABqAnQAagN8AHwBgwJkA2QCjQJ0AGoEfACD\nAYMCUwApBE7pAQAAACkB2gRheGlz6f////8pBdoBS9oEY2FzdNoDYW552glub3RfZXF1YWzaBWR0\neXBlKQLaAVjaCG1hc2tfdmFsqQByCwAAAPpeL2hvbWUvYnBuYWNobWFuL2FuYWNvbmRhMy9lbnZz\nL3NoYXJlZF9lbnYyL2xpYi9weXRob24zLjYvc2l0ZS1wYWNrYWdlcy9lbmVyZ3lmbG93L2FyY2hz\nL2Vmbi5wedoNcGZuX21hc2tfZnVuY04AAABzAgAAAAAD\n", [0.0], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "activation_49", "class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["tdist_2", 0, 0, {}]]]}, {"name": "sum", "class_name": "Dot", "config": {"name": "sum", "trainable": true, "axes": 0, "normalize": false}, "inbound_nodes": [[["mask", 0, 0, {}], ["activation_49", 0, 0, {}]]]}, {"name": "sum_dropout", "class_name": "Dropout", "config": {"name": "sum_dropout", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["sum", 0, 0, {}]]]}, {"name": "dense_0", "class_name": "Dense", "config": {"name": "dense_0", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["sum_dropout", 0, 0, {}]]]}, {"name": "activation_50", "class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_0", 0, 0, {}]]]}, {"name": "dense_0_dropout", "class_name": "Dropout", "config": {"name": "dense_0_dropout", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_50", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_0_dropout", 0, 0, {}]]]}, {"name": "activation_51", "class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_1_dropout", "class_name": "Dropout", "config": {"name": "dense_1_dropout", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_51", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 100, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1_dropout", 0, 0, {}]]]}, {"name": "activation_52", "class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "dense_2_dropout", "class_name": "Dropout", "config": {"name": "dense_2_dropout", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_52", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2_dropout", 0, 0, {}]]]}, {"name": "activation_53", "class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["activation_53", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}